
&НаСервере
Процедура ОбновитьТаблицу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетЗадачи.Ссылка.Исполнитель КАК Исполнитель,
		|	НАЧАЛОПЕРИОДА(ОтчетЗадачи.Ссылка.Дата, ДЕНЬ) КАК День,
		|	СУММА(ОтчетЗадачи.Часов) КАК Часов
		|ИЗ
		|	Документ.Отчет.Задачи КАК ОтчетЗадачи
		|ГДЕ
		|	ОтчетЗадачи.Ссылка.Проведен = ИСТИНА
		|	И ОтчетЗадачи.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетЗадачи.Ссылка.Исполнитель,
		|	НАЧАЛОПЕРИОДА(ОтчетЗадачи.Ссылка.Дата, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Дата1", Месяц.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Месяц.ДатаОкончания);
	//Запрос.УстановитьПараметр("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Таблица.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.День = ВыборкаДетальныеЗаписи.День;
		НоваяСтрока.ЧасовОтработанно = ВыборкаДетальныеЗаписи.Часов;
	КонецЦикла;

КонецПроцедуры
	
&НаСервере
Процедура МесяцПриИзмененииНаСервере()
	
	ОбновитьТаблицу();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	МесяцПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	Месяц.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Месяц.ДатаОкончания = КонецМесяца(ТекущаяДата());
	//Месяц.Вариант = ВариантСтандартногоПериода.Месяц;
	ОбновитьТаблицу();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтчет(Команда)
	
	П = Новый Структура;
	//П.Вставить("Исполнитель", Поставщик);
	
	Форма = ПолучитьФорму("Документ.Отчет.ФормаОбъекта", П);
	Форма.Открыть(); 

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗадачу(Команда)
	
	П = Новый Структура;
	//П.Вставить("Исполнитель", Поставщик);
	
	Форма = ПолучитьФорму("Справочник.Задача.ФормаОбъекта", П);
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоОтработанномуВремени(Команда)
	
	П = Новый Структура;
	//П.Вставить("Исполнитель", Поставщик);
	
	Форма = ПолучитьФорму("Обработка.ОтчетПоОтработанномуВремени.Форма.Форма", П);
	Форма.Открыть();
КонецПроцедуры
