
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	// Вставить содержимое обработчика.
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Наименование = &Наименование";
		
		
	Запрос.Параметры.Вставить("Наименование",СокрЛП(ПользователиИнформационнойБазы.ТекущийПользователь().Имя));	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПараметрыСеанса.ТекущийПользователь = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Сообщить("Сотрудник не определен!");
	КонецЕсли;
КонецПроцедуры
