
&НаКлиенте
Процедура ЗадачиЧасовПриИзменении(Элемент)
	ОбновитьОтработанноеВремя();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОтработанноеВремя(Знач Сумма = 0)

	Для каждого стр из Объект.Задачи Цикл
		Сумма = Сумма + стр.Часов;		
	КонецЦикла;	
	
	Объект.ОтработанноЧасов = Сумма;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтработанноеВремя();
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиОбработкаЗапросаОбновления()
	ОбновитьОтработанноеВремя();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОбновитьОтработанноеВремя();
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекСтр = Элементы.Задачи.ТекущиеДанные;
    Если Копирование тогда 
        ОбновитьОтработанноеВремя(ТекСтр.Часов);
    КонецЕсли; 
КонецПроцедуры
